In [1]:
import pandas as pd

In [2]:
#creating an array
array = [1, 3, 5, 7, 9, 11]
series_obj = pd.Series(array)
arr = series_obj.values
arr

array([ 1,  3,  5,  7,  9, 11], dtype=int64)

In [4]:
#reshaping the array
reshape_arr = arr.reshape((2, 3))
reshape_arr

array([[ 1,  3,  5],
       [ 7,  9, 11]], dtype=int64)

In [6]:
#making an array
array = ["Alan","Sean",
"Karpov", "Pam",
"Xavier","Armstrong"]

series_obj = pd.Series(array)
print("The Series:\n", series_obj)
arr = series_obj.values
arr

The Series:
 0         Alan
1         Sean
2       Karpov
3          Pam
4       Xavier
5    Armstrong
dtype: object

array(['Alan', 'Sean', 'Karpov', 'Pam', 'Xavier', 'Armstrong'],
      dtype=object)

In [7]:
reshaped_arr = arr.reshape((3,2))
print("After reshaping:\n", reshaped_arr)

After reshaping:
 [['Alan' 'Sean']
 ['Karpov' 'Pam']
 ['Xavier' 'Armstrong']]

In [11]:
df = pd.DataFrame({'A': ['Jamie', 'Bebe', 'Minerva'],
                  'B': ['PhD', 'Masters', 'Masters'],
                  'C': [30, 26, 25]})
df

         A        B   C
0    Jamie      PhD  30
1     Bebe  Masters  26
2  Minerva  Masters  25

In [15]:
pivoted = df.pivot(index='A',columns= 'B', values=['C','A'])
pivoted

              C             A
B       Masters  PhD  Masters    PhD
A
Bebe         26  NaN     Bebe    NaN
Jamie       NaN   30      NaN  Jamie
Minerva      25  NaN  Minerva    NaN

In [19]:
import pandas as pd

df = pd.DataFrame({'Name': ['Jeremy', 'Serena', 'Stephan', 'Joe', 'Emma', 'Tommy', 'Cynthia'],
                   'Gender': ['Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Female'],
                   'Age': [45, 6, 4, 36, 12, 32, 22]})

print("Dataset")
print(df)
print("-" * 40)

def age_bucket(age):
    if age <= 18:
        return "<18"
    else:
        return ">18"

df['Age Group'] = df['Age'].apply(age_bucket)

gender = pd.DataFrame(df['Gender'].value_counts(normalize=True) * 100).reset_index()
gender.columns = ['Gender', '%Gender']
df = pd.merge(left=df, right=gender, how='inner', on=['Gender'])

# Creating pivot table
table = pd.pivot_table(df, index=['Gender', '%Gender', 'Age Group'],
                       values=['Name'], aggfunc={'Name': 'count'})

print("Table")
print(table)

Dataset
      Name  Gender  Age
0   Jeremy    Male   45
1   Serena  Female    6
2  Stephan    Male    4
3      Joe    Male   36
4     Emma  Female   12
5    Tommy    Male   32
6  Cynthia  Female   22
----------------------------------------
Table
                            Name
Gender %Gender   Age Group
Female 42.857143 <18           2
                 >18           1
Male   57.142857 <18           1
                 >18           3